ZXC-zxc/GD32F470-libopencm3-usb/src/main.c
  /* configure USART1 TX as alternate function push-pull */
  gpio_mode_set(GPIOA, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_2 | GPIO_PIN_3);
  gpio_output_options_set(GPIOA, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ,
                          GPIO_PIN_2 | GPIO_PIN_3);
  /* USART interrupt configuration */
  nvic_irq_enable(USART1_IRQn, 0, 0);
  /* USART1 baudrate configuration */
  usart_baudrate_set(USART1, 115200);
  /* configure USART1 transmitter */
  usart_transmit_config(USART1, USART_TRANSMIT_ENABLE);
  /* configure USART1 receiver */
  usart_receive_config(USART1, USART_RECEIVE_ENABLE);
  /* enable USART1 */
  gd32usart_enable(USART1);
  usart_interrupt_enable(USART1, USART_INT_RBNE);
#else
  // libopencm3 init usart1
  ble_usart_init();
#endif

  for (uint8_t i = 0; i < TRANSMIT_SIZE; i++) {
    receiver_buffer0[i] = 0xFF;
    receiver_buffer1[i] = 0xFF;
  }

  /* USART0 transmit and USART1 receive */
  // while (transfersize--) {
  //   // /* wait until end of transmit */
  //   // while (RESET == usart_flag_get(USART0, USART_FLAG_TBE))
  //   //   ;
  //   // usart_data_transmit(USART0, transmitter_buffer[txcount0++]);

  //   // ble_usart_send(transmitter_buffer[txcount0++], 1);
  //   /* wait until end of transmit */
  //   while (RESET == usart_flag_get(USART1, USART_FLAG_TBE))
  //     ;
  //   usart_data_transmit(USART1, transmitter_buffer[txcount1++]);
  // }

  /* 开发板需要短接 PA2 == PA3*/
  /* 断点停住后查看recvBuf中值是否与transmitter_buffer相同*/
  ble_usart_send(transmitter_buffer, sizeof(transmitter_buffer));
  /* compare the received data with the send ones */
  state =
      memory_compare(transmitter_buffer, recvBuf, sizeof(transmitter_buffer));
  if (SUCCESS == state) {
  } else {
    while (1) {
      ;
    }
  }
  // /* USART1 transmit and USART0 receive */
  // transfersize = TRANSMIT_SIZE;
  // while (transfersize--) {
  //   /* wait until end of transmit */
  //   while (RESET == usart_flag_get(USART1, USART_FLAG_TBE))
  //     ;
  //   usart_data_transmit(USART1, transmitter_buffer[txcount1++]);

  //   while (RESET == usart_flag_get(USART0, USART_FLAG_RBNE))
  //     ;
  //   /* store the received byte in the receiver_buffer0 */
  //   receiver_buffer0[rxcount1++] = usart_data_receive(USART0);
  // }

  // /* compare the received data with the send ones */
  // state = memory_compare(receiver_buffer0, receiver_buffer1, TRANSMIT_SIZE);
  // if (SUCCESS == state) {
  // } else {
  //   while (1) {
  //     ;
  //   }
  // }
  // while (1) {
  //   ;
  // }
}
